## Plan Result (dev_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 1 to change, 90 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;dev-casetracker&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;dev-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;dev-courtfines&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;dev-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sds-api-mgmt&#34;]
* Update
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Delete
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;dev-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;dev-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;dev-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;dev-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;dev-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;dev-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;dev-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;dev-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;dev-trib-tansport-appeals&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["dev-casetracker"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "casetracker.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["dev-certificatedbailiffs"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "certificatedbailiffs.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["dev-courtfines"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "courtfines.direct.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["dev-immigrationappealsonline"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "immigrationappealsonline.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["pre-portal"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["sds-api-mgmt"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-admin-appeals"] will be destroyed
  # (because key ["dev-trib-admin-appeals"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "2023-10-23T14:17:37.6587203+00:00" -> null
      - host_name                = "dev.administrativeappeals.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-admin-appeals" -> null
      - name                     = "dev-trib-admin-appeals" -> null
      - validation_token         = "t27v4qsk5h3cnxynksrt8gytnpkyp80k" -> null

      - tls {
          - certificate_type    = "ManagedCertificate" -> null
          - minimum_tls_version = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-care-standards"] will be destroyed
  # (because key ["dev-trib-care-standards"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "2023-10-23T14:17:37.6654789+00:00" -> null
      - host_name                = "dev.carestandards.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-care-standards" -> null
      - name                     = "dev-trib-care-standards" -> null
      - validation_token         = "h7cn5dtjpv6wmpfdcf985sp2k1pms0l1" -> null

      - tls {
          - certificate_type    = "ManagedCertificate" -> null
          - minimum_tls_version = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-cicap"] will be destroyed
  # (because key ["dev-trib-cicap"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "0001-01-01T00:00:00.0000000" -> null
      - host_name                = "dev.cicap.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-cicap" -> null
      - name                     = "dev-trib-cicap" -> null

      - tls {
          - cdn_frontdoor_secret_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/secrets/46bf4e26-b006-473c-a3e8-f5962b672b98-dev-cicap-dsd-io" -> null
          - certificate_type        = "ManagedCertificate" -> null
          - minimum_tls_version     = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-employment-appeals"] will be destroyed
  # (because key ["dev-trib-employment-appeals"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "2023-10-23T14:33:43.2229140+00:00" -> null
      - host_name                = "dev.employmentappeals.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-employment-appeals" -> null
      - name                     = "dev-trib-employment-appeals" -> null
      - validation_token         = "w1kw6rgmjwhdd1hqjp0wcpnhbbh5plhb" -> null

      - tls {
          - certificate_type    = "ManagedCertificate" -> null
          - minimum_tls_version = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-finance-tax"] will be destroyed
  # (because key ["dev-trib-finance-tax"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "2023-10-23T15:12:13.7685348+00:00" -> null
      - host_name                = "dev.financeandtax.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-finance-tax" -> null
      - name                     = "dev-trib-finance-tax" -> null
      - validation_token         = "vnvbkvpbbmmwsynl3s4g36tb98pfnxrb" -> null

      - tls {
          - certificate_type    = "ManagedCertificate" -> null
          - minimum_tls_version = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-immigration-svcs"] will be destroyed
  # (because key ["dev-trib-immigration-svcs"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "2023-10-23T14:34:03.7727608+00:00" -> null
      - host_name                = "dev.immigrationservices.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-immigration-svcs" -> null
      - name                     = "dev-trib-immigration-svcs" -> null
      - validation_token         = "f4l8f55z1d63ttk19jkqt0cb412vvrsp" -> null

      - tls {
          - certificate_type    = "ManagedCertificate" -> null
          - minimum_tls_version = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-info-rights"] will be destroyed
  # (because key ["dev-trib-info-rights"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "0001-01-01T00:00:00.0000000" -> null
      - host_name                = "dev.informationrights.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-info-rights" -> null
      - name                     = "dev-trib-info-rights" -> null

      - tls {
          - cdn_frontdoor_secret_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/secrets/46bf4e26-b006-473c-a3e8-f5962b672b98-dev-informationrights-dsd-io" -> null
          - certificate_type        = "ManagedCertificate" -> null
          - minimum_tls_version     = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-land-reg-division"] will be destroyed
  # (because key ["dev-trib-land-reg-division"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "2023-10-23T15:12:13.7657531+00:00" -> null
      - host_name                = "dev.landregistrationdivision.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-land-reg-division" -> null
      - name                     = "dev-trib-land-reg-division" -> null
      - validation_token         = "34vhf5d97m8y1hmkzwn99fcz9xn3n635" -> null

      - tls {
          - certificate_type    = "ManagedCertificate" -> null
          - minimum_tls_version = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-lands-chamber"] will be destroyed
  # (because key ["dev-trib-lands-chamber"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "2023-10-23T15:12:14.3538729+00:00" -> null
      - host_name                = "dev.landschamber.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-lands-chamber" -> null
      - name                     = "dev-trib-lands-chamber" -> null
      - validation_token         = "3cz60lbp32049r7ws8rd44b1pgggsmg2" -> null

      - tls {
          - certificate_type    = "ManagedCertificate" -> null
          - minimum_tls_version = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["dev-trib-tansport-appeals"] will be destroyed
  # (because key ["dev-trib-tansport-appeals"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "2023-10-23T14:33:43.0073775+00:00" -> null
      - host_name                = "dev.transportappeals.dsd.io" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-tansport-appeals" -> null
      - name                     = "dev-trib-tansport-appeals" -> null
      - validation_token         = "sq0z9cv7lcqj0bvg60mjft8x3v82nl5m" -> null

      - tls {
          - certificate_type    = "ManagedCertificate" -> null
          - minimum_tls_version = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["dev-trib-admin-appeals"] will be destroyed
  # (because key ["dev-trib-admin-appeals"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-admin-appeals" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/dev-trib-admin-appeals",
        ] -> null
      - id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/associations/dev-trib-admin-appeals" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["dev-trib-care-standards"] will be destroyed
  # (because key ["dev-trib-care-standards"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-care-standards" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/dev-trib-care-standards",
        ] -> null
      - id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/associations/dev-trib-care-standards" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["dev-trib-cicap"] will be destroyed
  # (because key ["dev-trib-cicap"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-cicap" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/dev-trib-cicap",
        ] -> null
      - id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/associations/dev-trib-cicap" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["dev-trib-employment-appeals"] will be destroyed
  # (because key ["dev-trib-employment-appeals"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-employment-appeals" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/dev-trib-employment-appeals",
        ] -> null
      - id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/associations/dev-trib-employment-appeals" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["dev-trib-finance-tax"] will be destroyed
  # (because key ["dev-trib-finance-tax"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-finance-tax" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/dev-trib-finance-tax",
        ] -> null
      - id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/associations/dev-trib-finance-tax" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["dev-trib-immigration-svcs"] will be destroyed
  # (because key ["dev-trib-immigration-svcs"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "cust

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 -> null
      - name                            = "dev-trib-tansport-appealsHttpsRedirect" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Http",
        ] -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-admin-appeals"] will be destroyed
  # (because key ["dev-trib-admin-appeals"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtribadminappealsdevPremium-securityPolicy" -> null
      - name                     = "devtribadminappealsdevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribadminappealsdevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = false -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-admin-appeals" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-care-standards"] will be destroyed
  # (because key ["dev-trib-care-standards"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtribcarestandardsdevPremium-securityPolicy" -> null
      - name                     = "devtribcarestandardsdevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribcarestandardsdevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = false -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-care-standards" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-cicap"] will be destroyed
  # (because key ["dev-trib-cicap"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtribcicapdevPremium-securityPolicy" -> null
      - name                     = "devtribcicapdevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribcicapdevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-cicap" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-employment-appeals"] will be destroyed
  # (because key ["dev-trib-employment-appeals"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtribemploymentappealsdevPremium-securityPolicy" -> null
      - name                     = "devtribemploymentappealsdevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribemploymentappealsdevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = false -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-employment-appeals" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-finance-tax"] will be destroyed
  # (because key ["dev-trib-finance-tax"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtribfinancetaxdevPremium-securityPolicy" -> null
      - name                     = "devtribfinancetaxdevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribfinancetaxdevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = false -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-finance-tax" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-immigration-svcs"] will be destroyed
  # (because key ["dev-trib-immigration-svcs"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtribimmigrationsvcsdevPremium-securityPolicy" -> null
      - name                     = "devtribimmigrationsvcsdevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribimmigrationsvcsdevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = false -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-immigration-svcs" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-info-rights"] will be destroyed
  # (because key ["dev-trib-info-rights"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtribinforightsdevPremium-securityPolicy" -> null
      - name                     = "devtribinforightsdevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribinforightsdevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-info-rights" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-land-reg-division"] will be destroyed
  # (because key ["dev-trib-land-reg-division"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtriblandregdivisiondevPremium-securityPolicy" -> null
      - name                     = "devtriblandregdivisiondevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtriblandregdivisiondevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = false -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-land-reg-division" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-lands-chamber"] will be destroyed
  # (because key ["dev-trib-lands-chamber"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtriblandschamberdevPremium-securityPolicy" -> null
      - name                     = "devtriblandschamberdevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtriblandschamberdevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = false -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-lands-chamber" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["dev-trib-tansport-appeals"] will be destroyed
  # (because key ["dev-trib-tansport-appeals"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/devtribtansportappealsdevPremium-securityPolicy" -> null
      - name                     = "devtribtansportappealsdevPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribtansportappealsdevPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = false -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/dev-trib-tansport-appeals" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["dev-casetracker"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.dev"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "casetracker.justice.gov.uk"

      + record {
          + value = "px5pc3gxx0nsvpqmn8sng2rwkhk91yxt"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["dev-certificatedbailiffs"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.dev"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "certificatedbailiffs.justice.gov.uk"

      + record {
          + value = "gdgv783800ys5v1chsmz62gsqz6ncwpy"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["dev-courtfines"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.dev"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "courtfines.direct.gov.uk"

      + record {
          + value = "k1dq02cc20y2wbv12hlxm6d3v3q99ndq"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["dev-immigrationappealsonline"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.dev"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "immigrationappealsonline.justice.gov.uk"

      + record {
          + value = "rhvrfbphr5z3wfcmxsbc195zhfbbhd38"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pre-portal"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.pre-portal"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "q9h3xgdqd410ky9xftl5b111cv1zndbn"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sds-api-mgmt"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.sds-api-mgmt"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "dev.platform.hmcts.net"

      + record {
          + value = "fmhr9lqcdqymrkqn818g0cws5569jmp1"
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 1 to change, 90 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":615,"Program":"tfcmt","SHA1":"","Target":"dev_frontdoor","Vars":{}} -->